In [240]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt          
%matplotlib inline

In [241]:
mckensydata=pd.read_csv("D:/analytics/Hackathon/Mckensy/train.csv")

In [242]:
mckensydata.head()

,ID,Gender,DOB,Lead_Creation_Date,City_Code,City_Category,Employer_Code,Employer_Category1,Employer_Category2,Monthly_Income,...,Contacted,Source,Source_Category,Existing_EMI,Loan_Amount,Loan_Period,Interest_Rate,EMI,Var1,Approved
0,APPC90493171225,Female,23/07/79,15/07/16,C10001,A,COM0044082,A,4.0,2000.0,...,N,S122,G,0.0,NaN,NaN,NaN,NaN,0,0
1,APPD40611263344,Male,07/12/86,04/07/16,C10003,A,COM0000002,C,1.0,3500.0,...,Y,S122,G,0.0,20000.0,2.0,13.25,953.0,10,0
2,APPE70289249423,Male,10/12/82,19/07/16,C10125,C,COM0005267,C,4.0,2250.0,...,Y,S143,B,0.0,45000.0,4.0,NaN,NaN,0,0
3,APPF80273865537,Male,30/01/89,09/07/16,C10477,C,COM0004143,A,4.0,3500.0,...,Y,S143,B,0.0,92000.0,5.0,NaN,NaN,7,0
4,APPG60994436641,Male,19/04/85,20/07/16,C10002,A,COM0001781,A,4.0,10000.0,...,Y,S134,B,2500.0,50000.0,2.0,NaN,NaN,10,0

In [244]:
mckensydata.columns

Index(['ID', 'Gender', 'DOB', 'Lead_Creation_Date', 'City_Code',
       'City_Category', 'Employer_Code', 'Employer_Category1',
       'Employer_Category2', 'Monthly_Income',
       'Customer_Existing_Primary_Bank_Code', 'Primary_Bank_Type', 'Contacted',
       'Source', 'Source_Category', 'Existing_EMI', 'Loan_Amount',
       'Loan_Period', 'Interest_Rate', 'EMI', 'Var1', 'Approved'],
      dtype='object')

In [245]:
mckensydata.describe()

,Employer_Category2,Monthly_Income,Existing_EMI,Loan_Amount,Loan_Period,Interest_Rate,EMI,Var1,Approved
count,65415.000000,6.971300e+04,69662.000000,42004.000000,42004.000000,22276.000000,22276.000000,69713.000000,69713.000000
mean,3.720187,5.622283e+03,360.928751,39429.982859,3.890629,19.213570,1101.466242,3.948446,0.014631
std,0.807374,1.747671e+05,2288.517927,30727.595990,1.167491,5.847136,752.661394,3.819214,0.120073
min,1.000000,0.000000e+00,0.000000,5000.000000,1.000000,11.990000,118.000000,0.000000,0.000000
25%,4.000000,1.650000e+03,0.000000,20000.000000,3.000000,15.250000,649.000000,0.000000,0.000000
50%,4.000000,2.500000e+03,0.000000,30000.000000,4.000000,18.000000,941.000000,2.000000,0.000000
75%,4.000000,4.000000e+03,350.000000,50000.000000,5.000000,20.000000,1295.000000,7.000000,0.000000
max,4.000000,3.838384e+07,545436.500000,300000.000000,6.000000,37.000000,13556.000000,10.000000,1.000000

In [246]:
(mckensydata.isnull().sum()).sort_values(ascending=False)  ## to find out number of missing values(NA) columns

EMI                                    47437
Interest_Rate                          47437
Loan_Period                            27709
Loan_Amount                            27709
Customer_Existing_Primary_Bank_Code     9391
Primary_Bank_Type                       9391
Employer_Category2                      4298
Employer_Code                           4018
Employer_Category1                      4018
City_Code                                814
City_Category                            814
Existing_EMI                              51
DOB                                       15
Gender                                     0
Lead_Creation_Date                         0
Approved                                   0
Monthly_Income                             0
Var1                                       0
Contacted                                  0
Source                                     0
Source_Category                            0
ID                                         0
dtype: int64

In [247]:
mckensydata_num=mckensydata.select_dtypes(include=[np.number]) # strategy 1 split the data frame into numeric and character data frame and values
mckensydata_cat=mckensydata.select_dtypes(include=[object]) # numeric variable colulmns

In [248]:
mckensydata_num.shape  # numeric variable colulmns

(69713, 9)

In [249]:
mckensydata_cat.shape  # cat variable colulmns

(69713, 13)

In [250]:
mckensydata_num.head()

,Employer_Category2,Monthly_Income,Existing_EMI,Loan_Amount,Loan_Period,Interest_Rate,EMI,Var1,Approved
0,4.0,2000.0,0.0,NaN,NaN,NaN,NaN,0,0
1,1.0,3500.0,0.0,20000.0,2.0,13.25,953.0,10,0
2,4.0,2250.0,0.0,45000.0,4.0,NaN,NaN,0,0
3,4.0,3500.0,0.0,92000.0,5.0,NaN,NaN,7,0
4,4.0,10000.0,2500.0,50000.0,2.0,NaN,NaN,10,0

In [251]:
mckensydatavalues=mckensydata_num[["Approved"]]

In [252]:
mckensydatavalues.tail()

       Approved
69708         0
69709         0
69710         0
69711         0
69712         0

In [253]:
pd.value_counts(mckensydatavalues.Approved)

0    68693
1     1020
Name: Approved, dtype: int64

In [254]:
mckensydata_num=mckensydata_num.drop(["Approved"],axis=1)

In [255]:
(mckensydata_num.isnull().sum()).sort_values(ascending=False)  ## to find out number of missing values(NA) columns

EMI                   47437
Interest_Rate         47437
Loan_Period           27709
Loan_Amount           27709
Employer_Category2     4298
Existing_EMI             51
Var1                      0
Monthly_Income            0
dtype: int64

In [256]:
mckensydata_num1=mckensydata_num.apply(lambda  mckensydata_num:  mckensydata_num.fillna( mckensydata_num.mean()),axis=0)

In [257]:
(mckensydata_num1.isnull().sum()).sort_values(ascending=False)  ## to find out number of missing values(NA) columns

Var1                  0
EMI                   0
Interest_Rate         0
Loan_Period           0
Loan_Amount           0
Existing_EMI          0
Monthly_Income        0
Employer_Category2    0
dtype: int64

In [258]:
mckensydata_num1.head()

,Employer_Category2,Monthly_Income,Existing_EMI,Loan_Amount,Loan_Period,Interest_Rate,EMI,Var1
0,4.0,2000.0,0.0,39429.982859,3.890629,19.21357,1101.466242,0
1,1.0,3500.0,0.0,20000.000000,2.000000,13.25000,953.000000,10
2,4.0,2250.0,0.0,45000.000000,4.000000,19.21357,1101.466242,0
3,4.0,3500.0,0.0,92000.000000,5.000000,19.21357,1101.466242,7
4,4.0,10000.0,2500.0,50000.000000,2.000000,19.21357,1101.466242,10

In [259]:
mckensydata_cat.head()

,ID,Gender,DOB,Lead_Creation_Date,City_Code,City_Category,Employer_Code,Employer_Category1,Customer_Existing_Primary_Bank_Code,Primary_Bank_Type,Contacted,Source,Source_Category
0,APPC90493171225,Female,23/07/79,15/07/16,C10001,A,COM0044082,A,B001,P,N,S122,G
1,APPD40611263344,Male,07/12/86,04/07/16,C10003,A,COM0000002,C,B002,P,Y,S122,G
2,APPE70289249423,Male,10/12/82,19/07/16,C10125,C,COM0005267,C,B003,G,Y,S143,B
3,APPF80273865537,Male,30/01/89,09/07/16,C10477,C,COM0004143,A,B003,G,Y,S143,B
4,APPG60994436641,Male,19/04/85,20/07/16,C10002,A,COM0001781,A,B001,P,Y,S134,B

In [260]:
mckensydatavalues1=mckensydata_cat[["ID"]]

In [261]:
mckensydatavalues1.head()

                ID
0  APPC90493171225
1  APPD40611263344
2  APPE70289249423
3  APPF80273865537
4  APPG60994436641

In [262]:
mckensydata_cat=mckensydata_cat.drop(["ID"],axis=1)

In [263]:
mckensydata_cat.head(10)

,Gender,DOB,Lead_Creation_Date,City_Code,City_Category,Employer_Code,Employer_Category1,Customer_Existing_Primary_Bank_Code,Primary_Bank_Type,Contacted,Source,Source_Category
0,Female,23/07/79,15/07/16,C10001,A,COM0044082,A,B001,P,N,S122,G
1,Male,07/12/86,04/07/16,C10003,A,COM0000002,C,B002,P,Y,S122,G
2,Male,10/12/82,19/07/16,C10125,C,COM0005267,C,B003,G,Y,S143,B
3,Male,30/01/89,09/07/16,C10477,C,COM0004143,A,B003,G,Y,S143,B
4,Male,19/04/85,20/07/16,C10002,A,COM0001781,A,B001,P,Y,S134,B
5,Female,23/12/88,01/07/16,C10402,C,COM0007740,A,B014,P,N,S133,B
6,Male,28/03/73,02/07/16,C10022,B,COM0030526,B,B003,G,Y,S122,C
7,Female,12/11/90,03/07/16,C10003,A,COM0016738,A,B006,P,Y,S133,B
8,Male,03/03/77,02/07/16,C10003,A,COM0010626,A,B017,G,Y,S133,B
9,Female,13/12/90,02/07/16,C10014,B,COM0042212,A,NaN,NaN,N,S122,B

In [264]:
(mckensydata_cat.isnull().sum()).sort_values(ascending=False)  ## to find out number of missing values(NA) columns

Primary_Bank_Type                      9391
Customer_Existing_Primary_Bank_Code    9391
Employer_Category1                     4018
Employer_Code                          4018
City_Category                           814
City_Code                               814
DOB                                      15
Source_Category                           0
Source                                    0
Contacted                                 0
Lead_Creation_Date                        0
Gender                                    0
dtype: int64

In [265]:
mckensydata_cat1=mckensydata_cat.apply(lambda  mckensydata_cat:  mckensydata_cat.fillna( mckensydata_cat.value_counts().index[0]),axis=0)

In [266]:
(mckensydata_cat1.isnull().sum()).sort_values(ascending=False)  ## to find out number of missing values(NA) columns

Source_Category                        0
Source                                 0
Contacted                              0
Primary_Bank_Type                      0
Customer_Existing_Primary_Bank_Code    0
Employer_Category1                     0
Employer_Code                          0
City_Category                          0
City_Code                              0
Lead_Creation_Date                     0
DOB                                    0
Gender                                 0
dtype: int64

In [267]:
mckensydata_cat1.head(10)

,Gender,DOB,Lead_Creation_Date,City_Code,City_Category,Employer_Code,Employer_Category1,Customer_Existing_Primary_Bank_Code,Primary_Bank_Type,Contacted,Source,Source_Category
0,Female,23/07/79,15/07/16,C10001,A,COM0044082,A,B001,P,N,S122,G
1,Male,07/12/86,04/07/16,C10003,A,COM0000002,C,B002,P,Y,S122,G
2,Male,10/12/82,19/07/16,C10125,C,COM0005267,C,B003,G,Y,S143,B
3,Male,30/01/89,09/07/16,C10477,C,COM0004143,A,B003,G,Y,S143,B
4,Male,19/04/85,20/07/16,C10002,A,COM0001781,A,B001,P,Y,S134,B
5,Female,23/12/88,01/07/16,C10402,C,COM0007740,A,B014,P,N,S133,B
6,Male,28/03/73,02/07/16,C10022,B,COM0030526,B,B003,G,Y,S122,C
7,Female,12/11/90,03/07/16,C10003,A,COM0016738,A,B006,P,Y,S133,B
8,Male,03/03/77,02/07/16,C10003,A,COM0010626,A,B017,G,Y,S133,B
9,Female,13/12/90,02/07/16,C10014,B,COM0042212,A,B001,P,N,S122,B

In [268]:
from sklearn.preprocessing import LabelEncoder

In [269]:
le=LabelEncoder()

In [270]:
mckensydata_cat1=mckensydata_cat1.apply(le.fit_transform)

In [271]:
mckensydata_cat1.head()

,Gender,DOB,Lead_Creation_Date,City_Code,City_Category,Employer_Code,Employer_Category1,Customer_Existing_Primary_Bank_Code,Primary_Bank_Type,Contacted,Source,Source_Category
0,0,8112,42,0,0,29284,0,0,1,0,0,6
1,1,2593,9,2,0,0,2,1,1,1,0,6
2,1,3641,54,124,2,5126,2,2,0,1,15,1
3,1,10256,24,476,2,4079,0,2,0,1,15,1
4,1,6631,57,1,0,1775,0,0,1,1,7,1

In [272]:
mckensydatadf=pd.concat([mckensydatavalues,mckensydatavalues1,mckensydata_num1,mckensydata_cat1],axis=1)

In [273]:
mckensydatadf.head()

,Approved,ID,Employer_Category2,Monthly_Income,Existing_EMI,Loan_Amount,Loan_Period,Interest_Rate,EMI,Var1,...,Lead_Creation_Date,City_Code,City_Category,Employer_Code,Employer_Category1,Customer_Existing_Primary_Bank_Code,Primary_Bank_Type,Contacted,Source,Source_Category
0,0,APPC90493171225,4.0,2000.0,0.0,39429.982859,3.890629,19.21357,1101.466242,0,...,42,0,0,29284,0,0,1,0,0,6
1,0,APPD40611263344,1.0,3500.0,0.0,20000.000000,2.000000,13.25000,953.000000,10,...,9,2,0,0,2,1,1,1,0,6
2,0,APPE70289249423,4.0,2250.0,0.0,45000.000000,4.000000,19.21357,1101.466242,0,...,54,124,2,5126,2,2,0,1,15,1
3,0,APPF80273865537,4.0,3500.0,0.0,92000.000000,5.000000,19.21357,1101.466242,7,...,24,476,2,4079,0,2,0,1,15,1
4,0,APPG60994436641,4.0,10000.0,2500.0,50000.000000,2.000000,19.21357,1101.466242,10,...,57,1,0,1775,0,0,1,1,7,1

In [274]:
mckensydatadf.shape

(69713, 22)

In [275]:
mckensydatadf.columns

Index(['Approved', 'ID', 'Employer_Category2', 'Monthly_Income',
       'Existing_EMI', 'Loan_Amount', 'Loan_Period', 'Interest_Rate', 'EMI',
       'Var1', 'Gender', 'DOB', 'Lead_Creation_Date', 'City_Code',
       'City_Category', 'Employer_Code', 'Employer_Category1',
       'Customer_Existing_Primary_Bank_Code', 'Primary_Bank_Type', 'Contacted',
       'Source', 'Source_Category'],
      dtype='object')

In [289]:
mckensydatadf1=mckensydatadf.drop(["Var1","City_Code","Employer_Category2","Employer_Code","Customer_Existing_Primary_Bank_Code","Contacted"],axis=1)

In [290]:
mckensydatadf1.head()

,Approved,ID,Monthly_Income,Existing_EMI,Loan_Amount,Loan_Period,Interest_Rate,EMI,Gender,DOB,Lead_Creation_Date,City_Category,Employer_Category1,Primary_Bank_Type,Source,Source_Category
0,0,APPC90493171225,2000.0,0.0,39429.982859,3.890629,19.21357,1101.466242,0,8112,42,0,0,1,0,6
1,0,APPD40611263344,3500.0,0.0,20000.000000,2.000000,13.25000,953.000000,1,2593,9,0,2,1,0,6
2,0,APPE70289249423,2250.0,0.0,45000.000000,4.000000,19.21357,1101.466242,1,3641,54,2,2,0,15,1
3,0,APPF80273865537,3500.0,0.0,92000.000000,5.000000,19.21357,1101.466242,1,10256,24,2,0,0,15,1
4,0,APPG60994436641,10000.0,2500.0,50000.000000,2.000000,19.21357,1101.466242,1,6631,57,0,0,1,7,1

In [291]:
y=mckensydatadf1.Approved
X=mckensydatadf1.drop(["Approved","ID"],axis=1)

In [185]:
from sklearn.naive_bayes import BernoulliNB

In [186]:
BNB=BernoulliNB().fit(X,y)

In [187]:
BNB.score(X,y)

0.98536858261730231

In [188]:
BNBpredict=BNB.predict(X)

In [189]:
BNBresidual=y-BNBpredict

In [190]:
np.sqrt(np.mean((BNBresidual)**2))    #logorathmic error

0.12096039592650824

In [197]:
from sklearn.svm import SVC      ## Support Vector Machine ##

In [198]:
supportvector=SVC(kernel='sigmoid')

In [199]:
supportvector.fit(X,y)

SVC(C=1.0, cache_size=200, class_weight=None, coef0=0.0,
  decision_function_shape='ovr', degree=3, gamma='auto', kernel='sigmoid',
  max_iter=-1, probability=False, random_state=None, shrinking=True,
  tol=0.001, verbose=False)

In [200]:
supportvector.score(X,y)

0.98536858261730231

In [201]:
supportvectorpredict=supportvector.predict(X)

In [202]:
supportvectorresidual=y-supportvectorpredict

In [203]:
np.sqrt(np.mean((supportvectorresidual)**2))    #logorathmic error

0.12096039592650824

In [191]:
from sklearn.ensemble import GradientBoostingClassifier   ## Gradient Boosting Classifier ##

In [192]:
gbm = GradientBoostingClassifier().fit(X, y)

In [193]:
gbm.score(X, y)

0.98561243957368061

In [194]:
gbmpredict=gbm.predict(X)

In [195]:
gbmresidual=y-gbmpredict

In [196]:
np.sqrt(np.mean((gbmresidual)**2))    #logorathmic error

0.11994815724436678

In [292]:
from sklearn.naive_bayes import GaussianNB

In [293]:
gnb = GaussianNB()

In [294]:
gnb.fit(X,y)

GaussianNB(priors=None)

In [295]:
gnb.score(X,y)

0.92972616298251398

In [296]:
gnbpredict=gnb.predict(X)

In [297]:
gnbresidual=y-gnbpredict

In [298]:
np.sqrt(np.mean((gnbresidual)**2))    #logorathmic error

0.2650921293012789

In [388]:
from sklearn.linear_model import LinearRegression   # training data

In [389]:
Randfor=RandomForestRegressor(n_estimators=1000)

In [390]:
LinReg=LinearRegression()

In [391]:
LinReg.fit(X,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [392]:
LinReg.score(X,y)

0.022189913845569009

In [279]:
from sklearn.ensemble import RandomForestRegressor   #Random Forest

In [286]:
Randfor=RandomForestRegressor(n_estimators=5000)

In [287]:
Randfor.fit(X,y)

RandomForestRegressor(bootstrap=True, criterion='mse', max_depth=None,
           max_features='auto', max_leaf_nodes=None,
           min_impurity_decrease=0.0, min_impurity_split=None,
           min_samples_leaf=1, min_samples_split=2,
           min_weight_fraction_leaf=0.0, n_estimators=5000, n_jobs=1,
           oob_score=False, random_state=None, verbose=0, warm_start=False)

In [288]:
Randfor.score(X,y)

0.85575146291029869

In [635]:
Randforpredict=Randfor.predict(X)

In [636]:
randforresidual=y-Randforpredict

In [637]:
np.sqrt(np.mean((randforresidual)**2))    #logorathmic error

0.045273860987278355

In [676]:
from sklearn.linear_model import LogisticRegression

In [677]:
logreg = LogisticRegression()

In [678]:
logreg.fit(X, y)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [679]:
logreg.score(X,y)   ## accuracy from Nural network model

0.98532554903676506

In [680]:
logregpredict=logreg.predict(X)

In [299]:
mckensydata_test=pd.read_csv("D:/analytics/Hackathon/Mckensy/test.csv")

In [300]:
mckensydata_test.head()

,ID,Gender,DOB,Lead_Creation_Date,City_Code,City_Category,Employer_Code,Employer_Category1,Employer_Category2,Monthly_Income,...,Primary_Bank_Type,Contacted,Source,Source_Category,Existing_EMI,Loan_Amount,Loan_Period,Interest_Rate,EMI,Var1
0,APPA70109647212,Male,03/06/88,05/07/16,C10028,C,COM0002222,A,4.0,2150.0,...,P,Y,S122,B,0.0,10000.0,3.0,20.0,372.0,4
1,APPB10687939341,Male,13/07/81,01/07/16,C10003,A,COM0001784,C,4.0,4200.0,...,P,Y,S133,C,0.0,69000.0,5.0,24.0,1985.0,7
2,APPC80449411414,Female,19/11/90,01/07/16,C10009,B,COM0045260,B,4.0,1000.0,...,P,N,S133,B,0.0,NaN,NaN,NaN,NaN,0
3,APPD30665094501,Female,15/10/92,01/07/16,C10005,A,COM0000085,A,3.0,1465.0,...,P,N,S133,C,0.0,NaN,NaN,NaN,NaN,0
4,APPE80379821637,Male,21/09/88,01/07/16,C10005,A,COM0006422,A,4.0,2340.0,...,P,Y,S143,B,500.0,10000.0,2.0,NaN,NaN,0

In [301]:
mckensydata_test.describe()

,Employer_Category2,Monthly_Income,Existing_EMI,Loan_Amount,Loan_Period,Interest_Rate,EMI,Var1
count,28342.000000,3.003700e+04,30005.000000,18166.000000,18166.000000,9652.000000,9652.000000,30037.000000
mean,3.728248,3.977139e+03,348.909060,39482.990201,3.903116,19.280537,1094.914836,3.962313
std,0.794883,2.328960e+04,1000.816847,30527.865594,1.150820,5.882246,727.452303,3.821020
min,1.000000,0.000000e+00,0.000000,5000.000000,1.000000,11.990000,118.000000,0.000000
25%,4.000000,1.650000e+03,0.000000,20000.000000,3.000000,15.250000,625.000000,0.000000
50%,4.000000,2.500000e+03,0.000000,30000.000000,4.000000,18.000000,946.000000,2.000000
75%,4.000000,4.000000e+03,350.000000,50000.000000,5.000000,20.000000,1291.000000,7.000000
max,4.000000,3.500000e+06,43000.000000,300000.000000,6.000000,37.000000,6979.000000,10.000000

In [302]:
(mckensydata_test.isnull().sum()).sort_values(ascending=False)  ## to find out number of missing values(NA) columns

Interest_Rate                          20385
EMI                                    20385
Loan_Period                            11871
Loan_Amount                            11871
Customer_Existing_Primary_Bank_Code     4037
Primary_Bank_Type                       4037
Employer_Category2                      1695
Employer_Category1                      1605
Employer_Code                           1605
City_Category                            314
City_Code                                314
Existing_EMI                              32
DOB                                        3
Gender                                     0
Lead_Creation_Date                         0
Var1                                       0
Monthly_Income                             0
Contacted                                  0
Source                                     0
Source_Category                            0
ID                                         0
dtype: int64

In [303]:
mckensydata_testnum=mckensydata_test.select_dtypes(include=[np.number]) # strategy 1 split the data frame into numeric and character data frame and values
mckensydata_testcat=mckensydata_test.select_dtypes(include=[object])  # numeric variable colulmns

In [304]:
mckensydata_testnum.shape  # numeric variable colulmns

(30037, 8)

In [305]:
mckensydata_testcat.shape  # cat variable colulmns

(30037, 13)

In [306]:
mckensydata_testnum.head()

,Employer_Category2,Monthly_Income,Existing_EMI,Loan_Amount,Loan_Period,Interest_Rate,EMI,Var1
0,4.0,2150.0,0.0,10000.0,3.0,20.0,372.0,4
1,4.0,4200.0,0.0,69000.0,5.0,24.0,1985.0,7
2,4.0,1000.0,0.0,NaN,NaN,NaN,NaN,0
3,3.0,1465.0,0.0,NaN,NaN,NaN,NaN,0
4,4.0,2340.0,500.0,10000.0,2.0,NaN,NaN,0

In [307]:
(mckensydata_testnum.isnull().sum()).sort_values(ascending=False)  ## to find out number of missing values(NA) columns

EMI                   20385
Interest_Rate         20385
Loan_Period           11871
Loan_Amount           11871
Employer_Category2     1695
Existing_EMI             32
Var1                      0
Monthly_Income            0
dtype: int64

In [308]:
mckensydata_testnum1=mckensydata_testnum.apply(lambda  mckensydata_testnum:  mckensydata_testnum.fillna( mckensydata_testnum.mean()),axis=0)

In [309]:
(mckensydata_testnum1.isnull().sum()).sort_values(ascending=False)  ## to find out number of missing values(NA) columns

Var1                  0
EMI                   0
Interest_Rate         0
Loan_Period           0
Loan_Amount           0
Existing_EMI          0
Monthly_Income        0
Employer_Category2    0
dtype: int64

In [310]:
mckensydata_testnum1.head()

,Employer_Category2,Monthly_Income,Existing_EMI,Loan_Amount,Loan_Period,Interest_Rate,EMI,Var1
0,4.0,2150.0,0.0,10000.000000,3.000000,20.000000,372.000000,4
1,4.0,4200.0,0.0,69000.000000,5.000000,24.000000,1985.000000,7
2,4.0,1000.0,0.0,39482.990201,3.903116,19.280537,1094.914836,0
3,3.0,1465.0,0.0,39482.990201,3.903116,19.280537,1094.914836,0
4,4.0,2340.0,500.0,10000.000000,2.000000,19.280537,1094.914836,0

In [311]:
mckensydata_testnum1.shape

(30037, 8)

In [312]:
mckensydata_testcat.head()

,ID,Gender,DOB,Lead_Creation_Date,City_Code,City_Category,Employer_Code,Employer_Category1,Customer_Existing_Primary_Bank_Code,Primary_Bank_Type,Contacted,Source,Source_Category
0,APPA70109647212,Male,03/06/88,05/07/16,C10028,C,COM0002222,A,B002,P,Y,S122,B
1,APPB10687939341,Male,13/07/81,01/07/16,C10003,A,COM0001784,C,B004,P,Y,S133,C
2,APPC80449411414,Female,19/11/90,01/07/16,C10009,B,COM0045260,B,B002,P,N,S133,B
3,APPD30665094501,Female,15/10/92,01/07/16,C10005,A,COM0000085,A,B001,P,N,S133,C
4,APPE80379821637,Male,21/09/88,01/07/16,C10005,A,COM0006422,A,B004,P,Y,S143,B

In [313]:
mckensydatavaluestest=mckensydata_testcat[["ID"]]

In [314]:
mckensydatavaluestest.head()

                ID
0  APPA70109647212
1  APPB10687939341
2  APPC80449411414
3  APPD30665094501
4  APPE80379821637

In [315]:
mckensydatavaluestest.shape

(30037, 1)

In [316]:
mckensydata_testcat=mckensydata_testcat.drop(["ID"],axis=1)

In [317]:
mckensydata_testcat.head()

,Gender,DOB,Lead_Creation_Date,City_Code,City_Category,Employer_Code,Employer_Category1,Customer_Existing_Primary_Bank_Code,Primary_Bank_Type,Contacted,Source,Source_Category
0,Male,03/06/88,05/07/16,C10028,C,COM0002222,A,B002,P,Y,S122,B
1,Male,13/07/81,01/07/16,C10003,A,COM0001784,C,B004,P,Y,S133,C
2,Female,19/11/90,01/07/16,C10009,B,COM0045260,B,B002,P,N,S133,B
3,Female,15/10/92,01/07/16,C10005,A,COM0000085,A,B001,P,N,S133,C
4,Male,21/09/88,01/07/16,C10005,A,COM0006422,A,B004,P,Y,S143,B

In [318]:
(mckensydata_testcat.isnull().sum()).sort_values(ascending=False)  ## to find out number of missing values(NA) columns

Primary_Bank_Type                      4037
Customer_Existing_Primary_Bank_Code    4037
Employer_Category1                     1605
Employer_Code                          1605
City_Category                           314
City_Code                               314
DOB                                       3
Source_Category                           0
Source                                    0
Contacted                                 0
Lead_Creation_Date                        0
Gender                                    0
dtype: int64

In [319]:
mckensydata_testcat1=mckensydata_testcat.apply(lambda  mckensydata_testcat:  mckensydata_testcat.fillna( mckensydata_testcat.value_counts().index[0]),axis=0)

In [320]:
mckensydata_testcat1.head()

,Gender,DOB,Lead_Creation_Date,City_Code,City_Category,Employer_Code,Employer_Category1,Customer_Existing_Primary_Bank_Code,Primary_Bank_Type,Contacted,Source,Source_Category
0,Male,03/06/88,05/07/16,C10028,C,COM0002222,A,B002,P,Y,S122,B
1,Male,13/07/81,01/07/16,C10003,A,COM0001784,C,B004,P,Y,S133,C
2,Female,19/11/90,01/07/16,C10009,B,COM0045260,B,B002,P,N,S133,B
3,Female,15/10/92,01/07/16,C10005,A,COM0000085,A,B001,P,N,S133,C
4,Male,21/09/88,01/07/16,C10005,A,COM0006422,A,B004,P,Y,S143,B

In [321]:
(mckensydata_testcat1.isnull().sum()).sort_values(ascending=False)  ## to find out number of missing values(NA) columns

Source_Category                        0
Source                                 0
Contacted                              0
Primary_Bank_Type                      0
Customer_Existing_Primary_Bank_Code    0
Employer_Category1                     0
Employer_Code                          0
City_Category                          0
City_Code                              0
Lead_Creation_Date                     0
DOB                                    0
Gender                                 0
dtype: int64

In [322]:
mckensydata_testcat1.shape

(30037, 12)

In [323]:
from sklearn.preprocessing import LabelEncoder

In [324]:
le=LabelEncoder()

In [325]:
mckensydata_testcat1=mckensydata_testcat1.apply(le.fit_transform)

In [326]:
mckensydata_testcat1.head()

,Gender,DOB,Lead_Creation_Date,City_Code,City_Category,Employer_Code,Employer_Category1,Customer_Existing_Primary_Bank_Code,Primary_Bank_Type,Contacted,Source,Source_Category
0,1,778,12,27,2,2060,0,1,1,1,0,1
1,1,3640,0,2,0,1704,2,3,1,1,8,2
2,0,5436,0,8,1,15737,1,1,1,0,8,1
3,0,4313,0,4,0,83,0,0,1,0,8,2
4,1,5938,0,4,0,4788,0,3,1,1,16,1

In [327]:
mckensydata_testcat1.shape

(30037, 12)

In [332]:
mckensydatadf_test=pd.concat([mckensydatavaluestest,mckensydata_testnum1,mckensydata_testcat1],axis=1)

In [333]:
mckensydatadf_test.head()

,ID,Employer_Category2,Monthly_Income,Existing_EMI,Loan_Amount,Loan_Period,Interest_Rate,EMI,Var1,Gender,...,Lead_Creation_Date,City_Code,City_Category,Employer_Code,Employer_Category1,Customer_Existing_Primary_Bank_Code,Primary_Bank_Type,Contacted,Source,Source_Category
0,APPA70109647212,4.0,2150.0,0.0,10000.000000,3.000000,20.000000,372.000000,4,1,...,12,27,2,2060,0,1,1,1,0,1
1,APPB10687939341,4.0,4200.0,0.0,69000.000000,5.000000,24.000000,1985.000000,7,1,...,0,2,0,1704,2,3,1,1,8,2
2,APPC80449411414,4.0,1000.0,0.0,39482.990201,3.903116,19.280537,1094.914836,0,0,...,0,8,1,15737,1,1,1,0,8,1
3,APPD30665094501,3.0,1465.0,0.0,39482.990201,3.903116,19.280537,1094.914836,0,0,...,0,4,0,83,0,0,1,0,8,2
4,APPE80379821637,4.0,2340.0,500.0,10000.000000,2.000000,19.280537,1094.914836,0,1,...,0,4,0,4788,0,3,1,1,16,1

In [334]:
mckensydatadf_test.shape

(30037, 21)

In [335]:
(mckensydatadf_test.isnull().sum()).sort_values(ascending=False)  ## to find out number of missing values(NA) columns

Source_Category                        0
Gender                                 0
Employer_Category2                     0
Monthly_Income                         0
Existing_EMI                           0
Loan_Amount                            0
Loan_Period                            0
Interest_Rate                          0
EMI                                    0
Var1                                   0
DOB                                    0
Source                                 0
Lead_Creation_Date                     0
City_Code                              0
City_Category                          0
Employer_Code                          0
Employer_Category1                     0
Customer_Existing_Primary_Bank_Code    0
Primary_Bank_Type                      0
Contacted                              0
ID                                     0
dtype: int64

In [336]:
mckensydatadf_test1=mckensydatadf_test.drop(["Var1","City_Code","Employer_Category2","Employer_Code","Customer_Existing_Primary_Bank_Code","Contacted"],axis=1)

In [337]:
mckensydatadf_test1.head()

,ID,Monthly_Income,Existing_EMI,Loan_Amount,Loan_Period,Interest_Rate,EMI,Gender,DOB,Lead_Creation_Date,City_Category,Employer_Category1,Primary_Bank_Type,Source,Source_Category
0,APPA70109647212,2150.0,0.0,10000.000000,3.000000,20.000000,372.000000,1,778,12,2,0,1,0,1
1,APPB10687939341,4200.0,0.0,69000.000000,5.000000,24.000000,1985.000000,1,3640,0,0,2,1,8,2
2,APPC80449411414,1000.0,0.0,39482.990201,3.903116,19.280537,1094.914836,0,5436,0,1,1,1,8,1
3,APPD30665094501,1465.0,0.0,39482.990201,3.903116,19.280537,1094.914836,0,4313,0,0,0,1,8,2
4,APPE80379821637,2340.0,500.0,10000.000000,2.000000,19.280537,1094.914836,1,5938,0,0,0,1,16,1

In [338]:
X=mckensydatadf_test1.drop(["ID"],axis=1)

In [238]:
supportvectorpredict_test=supportvector.predict(X)

In [150]:
BNBpredict_test=BNB.predict(X)

In [73]:
gbmpredict_test=gbm.predict(X)

In [339]:
gnbpredict_test=gnb.predict(X)

In [791]:
neighpredict_test=neigh.predict(X)

In [513]:
Randforpredict_test=Randfor.predict(X)

In [715]:
logreg_test=logreg.predict(X)

In [595]:
neuralpredict_test=neural.predict(X)

In [95]:
DecTreepredict1=DecTree.predict(X)

In [340]:
pd.DataFrame(gnbpredict_test).to_csv("D:/analytics/Hackathon/Mckensy/gnbpredict_test.csv") #converting to csv download from home of jupyter notebook then convert the values in csv to exp in csv using exp() the file will ne in local folder